[
      [
            " \n\nI had a bsc wallet that i had forgotten about. Today I opened it and noticed I had gotten a bunch of tokens airdropped to me. Here's what i got and how much it's worth (in usd)\n\n150k Minereum - $13.6k\n\n960k BestAir - $80k\n\n800k TheVera - $185k\n\n1.5m Zepe - $270k\n\nCool right? I basically got half a million for free. But there's a catch. These tokens can not actually be redeemed. They are scams.\n\nLet's look at them and what they do\n\n**Minereum:** This one is the first one i got (3 months ago). It exists on both ethereum and bsc.\n\nA lot of addresses received big amount of this coin that shows up to be thousands of dollars worth. But you can not actually spend these coins.\n\nThey claim to be \"self mining smart contracts\". You basically have to pay 0.30 BNB for level 2 or 0.90 BNB for level 3, and they will start \"mining\" and you'll get some dust worth cents. It is almost impossible to be able to get back the value of the BNB you paid.\n\n**BestAir, Zepe, TheVera:**\n\nThese ones are a simpler scam than minereum. You get some coins, and when you try to swap them on pancakeswap or some other dex the transaction won't go through.\n\nYou will have to visit the token's website and it will ask you to approve a smart contract. By doing that you're giving access to your wallet to the attacker.\n\nIf you do that your wallet gets drained and you lose whatever coins you have in it.\n\nSo yeah, be careful and don't get excited over these. And do not let the greed take over when you get airdropped a huge amount of money.\n\nAlways do some research on random coins that you got before trying to do anything with them.\n\nA simple '\\[token name\\] scam' google search can save you a lot of money",
            {
                  "entities": [
                        [
                              761,
                              764,
                              "crypto"
                        ],
                        [
                              785,
                              788,
                              "crypto"
                        ],
                        [
                              933,
                              936,
                              "crypto"
                        ]
                  ]
            }
      ],
      [
            "A post on the hot page claims that the US Senate has requested information about Tether‘s backing by Dec 3rd. \nThis is, at the very least, misleading and likely to induce FUD. \n\nActual story: \n\nThe ~~US Senate~~ a single member of the Senate, Sherrod Brown, sent ~~a letter to Tether~~ letters to all major stable coin issuers requesting ~~specific information about their backing~~ general information about each coins functionality. Mostly questions about the process of minting and redemption and its stability. \nFurther, it isn’t clear if the letter to Tether has even been sent yet. \n\nSo if there’s actually a crackdown on USDT incoming, it’s a long way down the road from here. The wheels of justice churn slowly and this is nothing but an initial request to understand how stablecoins work in comparison to banks. \n\nPlease do your own research, this took 2min of Googling. \n\nThis is the letter (copy pasted because I can’t put images in my posts): \n\n\nI write to request information regarding the Tether stablecoin. As documented in the recent report (Report) by the President’s Working Group on Financial Markets (the PWG), stablecoins present investor protection risks and raise several market integrity concerns. Consumers’ increased use of stablecoins, and their importance in effecting transactions in digital assets, underscores the need for greater understanding of the basic operation, and limitations, of Tether.\nAs the PWG noted, the market capitalization of stablecoins issued by the largest stablecoin issuers exceeded $127 billion as of October 2021, reflecting an almost 500 percent increase over the prior year. The complex terms and conditions applicable to digital assets and stablecoins, as well as the need for reliable and resilient underlying networks, can make it difficult for investors and consumers to fully understand the details of how those assets function and their potential risks. I have significant concerns with the non-standardized terms applicable to redemption of particular stablecoins, how those terms differ from traditional assets, and how those terms may not be consistent across digital asset trading platforms.\nEven though stablecoins are typically “minted” in exchange for U.S. dollars, or other conventional currency, the purchase of stablecoins through a trading platform may not provide customers with the same rights and entitlements as a direct purchase from an issuer. In addition, customers may have different rights based on the amount of stablecoins owned or transacted. Furthermore, because the term stablecoin is used broadly, users may not appreciate the complexity and distinct features and terms of each stablecoin.\nAccordingly, given the importance of the specifics related to the use of Tether to investors and consumers, please respond to the questions below in clear, straightforward terms. I understand that any response would not affect or change the binding terms or conditions applicable to any particular customer or circumstance, but your ability to provide information that can clarify the basic operational features of Tether is critical to improve the understanding of digital assets.\n\n**1. Please describe the basic purchase, exchange, or minting process[es] by which customers can acquire Tether for U.S. dollars. In your answer, explain any relevant limitations or qualifications to engaging in and completing that process.**\n\n**2. Please detail the process to redeem Tether and receive U.S. dollars. Here, also, identify any requirements or limits, including any minimum redemption size, waiting period, or qualifications.**\n\n**3. Since Tether’s inception, how many Tether tokens have been issued, and how many have been redeemed? Over the last 12 months, what is the greatest percentage of the Tether in circulation at the beginning of a calendar week to be redeemed in the subsequent seven days?**\n\n**4. Briefly characterize the market or operational conditions that would prevent the purchase, or redemption, of Tether for U.S. dollars, or another digital asset. For purposes of answering this question, do not list or describe legal or regulatory limitations currently described in a user agreement or terms of service. For each condition identified, please provide at least one example that occurred in the past 12 months and its duration.**\n\n**5. Please identify any trading platforms that have enhanced capabilities, privileges, or special arrangements with respect to Tether, identifying those features and their basis (e.g., contractual or common control).**\n\n**6. Please summarize any internal reviews or studies your company has conducted about how specific levels of redemptions would affect Tether, including its convertibility into U.S. dollars, or would affect the financial position of your company.** \n\nPlease respond to the above by December 3. I appreciate your attention to this matter, and thank you for your timely cooperation.\n\nSincerely,\nSherrod Brown Chairman\n\n\nEDIT: Links \n\nSummary: https://www.theblockcrypto.com/amp/linked/125273/senate-banking-committee-chair-seeks-answers-on-stablecoins-from-centre-paxos-and-more\n\nLetter: https://www.banking.senate.gov/imo/media/doc/letter_to_tether.pdf",
            {
                  "entities": [
                        [
                              81,
                              87,
                              "crypto"
                        ],
                        [
                              277,
                              283,
                              "crypto"
                        ],
                        [
                              557,
                              563,
                              "crypto"
                        ],
                        [
                              1003,
                              1009,
                              "crypto"
                        ],
                        [
                              1420,
                              1426,
                              "crypto"
                        ],
                        [
                              2753,
                              2759,
                              "crypto"
                        ],
                        [
                              3095,
                              3101,
                              "crypto"
                        ],
                        [
                              3268,
                              3274,
                              "crypto"
                        ],
                        [
                              3448,
                              3454,
                              "crypto"
                        ],
                        [
                              3618,
                              3624,
                              "crypto"
                        ],
                        [
                              3647,
                              3653,
                              "crypto"
                        ],
                        [
                              3776,
                              3782,
                              "crypto"
                        ],
                        [
                              3996,
                              4002,
                              "crypto"
                        ],
                        [
                              4457,
                              4463,
                              "crypto"
                        ],
                        [
                              4685,
                              4691,
                              "crypto"
                        ],
                        [
                              628,
                              632,
                              "crypto"
                        ]
                  ]
            }
      ],
      [
            "I will clarify that I am from a shithole third world country (sorry for my English) and I keep all my savings in cryptocurrency in BTC. I had 1 whole BTC (welcome to my DM, scammers). This is a lot of money for me, with my salary of $720/month.\n\nI have always believed that I am quite tech-savvy and have computer skills above the regular user. I was especially interested in security. I loved to climb in the settings, turn on all the security options EVERYWHERE, on the PC and phone - in all programs and applications.\n\nMy computer was no exception, which at first was my working PC and then migrated to the basement, got a couple of cards and began to mine ETH.\n\nIt all started that I downloaded a new version of the miner from a phishing site that was in the top in Google at my request.\n\nThe miner mined as it should, but on the first launch, he injected an exploit into my PC (Windows 10) that gave an attacker access to Googgle Remote Desktop. And this is access to everything. This alone gave the hacker access to my entire electronic life. My Google account, passwords in Chrome. I EVEN MADE A QR RECOVERY SCREENSHOT OF Google Autenteficator AND IT SYNCHRONIZED WITH Google Photos.\n\nAt 1 am I received two e-mails about the successful entry into my accounts in Binance and another local exchange in my country. But I have zeros in my accounts.\n\nMy bitcoin was on my electrum, which was installed on the same PC. The only thing that saved me was that I put a password on my seed. BUT THIS PASSWORD WAS AMONG THE SAVED ON GOOGLE CHROME.\n\nAn elementary substitution of each password from Chrome into electrum would give access to all my funds sooner or later.\n\nI must say that I did not immediately understand what was the matter. I reinstalled Windows but ran the same miner again, and everything was repeated. The problem was that the memory was clogged and I was losing the hashrate and I was looking for a problem in this.\n\nOnce again, when I was sitting at the computer, I saw a standard notification by Chrome Remote YOUR COMPUTER IS CONTROLLED by [username@gmail.com](mailto:username@gmail.com) (this was my personal account). I understood everything. I instantly transferred all my money via phone to another address in Samourai Wallet.\n\nAnd the next day I was already unpacking my new Trezor.\n\nI must say that I was quite negative about hardware wallets, thinking that I had enough skills to secure myself on my PC or phone.\n\nNow I advise everyone to have a hardware wallet.\n\n&#x200B;\n\nTL; TR: Hackers managed to hack me but failed to steal my bitcoins.",
            {
                  "entities": [
                        [
                              1357,
                              1364,
                              "crypto"
                        ],
                        [
                              2559,
                              2566,
                              "crypto"
                        ],
                        [
                              131,
                              134,
                              "crypto"
                        ],
                        [
                              150,
                              153,
                              "crypto"
                        ],
                        [
                              660,
                              663,
                              "crypto"
                        ]
                  ]
            }
      ],
      [
            "I'm 23, I'm from Brazil and I have 30k dollars on my bank account. I'm thinking about invest 20% of it (about to 6k dollars) on bitcoins, I hope it can reach 200k dollars or more (1kk dol) in future, but at the same time I'm so afraid of losing all of this money. \n\nIdk what to do, I'm so convicted to do it, but i'm so unlucky. :p \n\n&#x200B;\n\nWhat you guys would do?\n\n&#x200B;\n\nSorry for my grammar mistakes.",
            {
                  "entities": [
                        [
                              128,
                              135,
                              "crypto"
                        ]
                  ]
            }
      ],
      [
            "Awareness about rollups is increasing exponentially, but there are still too many bad takes. Here, I'll address some of these myths and misconceptions to the best of my knowledge. Feel free to ask more questions, I'll edit them in. Also, please correct me if I get something wrong.\n\nI believe a lot of misconceptions are because people are stuck with the old monolithic blockchain ways where it is assumed that there's only one way to do things, and that is that one blockchain will do everything. So, let's begin with that, and also, thanks to r/ethfinance users for contributing these misconceptions.\n\n**Addendum**: Now that this post is pinned, I'm adding a couple of links so you can learn what rollups are. This is how Ethereum & the wider blockchain industry will scale.\n\n[An Incomplete Guide to Rollups (vitalik.ca)](https://vitalik.ca/general/2021/01/05/rollup.html)\n\n[https://www.youtube.com/watch?v=7pWxCklcNsU](https://www.youtube.com/watch?v=7pWxCklcNsU&t=1s)\n\nUpdated on 14th October 2021. \n\n# Rollups are a temporary band aid fix - X, Y, Z blockchain can do it on L1 so they don't need rollups\n\n(by u/hehechibby, u/ec265)\n\nRollups are the present and future of the blockchain industry.\n\nBut first, a brief perspective shift is required to understand why rollups are essential. Until now, blockchains have had to do it all - execution, consensus/security and data availability. This has led to significant bottlenecks and inefficiencies, reflected in the blockchain trilemma. Rollups are blockchains that are laser focused on one thing, and one thing exclusively: executing transactions as fast as possible, while \"outsourcing\" the hard work of security and data availability to a different L1 chain that is better at it. It's simple division of labour or specialization in action. Just like it led exponential growth in the industrial revolution, so will it lead exponential increase in scalability for the blockchain industry.\n\nNow, X, Y, Z blockchain may have compromised significant amounts of decentralization and security to get high scalability, and Ethereum and Bitcoin may have compromised scalability to get high security and decentralization. Rollups are simply constructions that can get the best of all worlds - with high scalability, security, *and* decentralization.\n\nThe important point is that it doesn't matter if it's an L1 or a rollup - to the user they are just interacting with an execution layer. **Execution layers - L1s and rollups - should be directly compared with each other.** Solana and Avalanche are not competing with Ethereum - they are competing with Arbitrum One and StarkNet. \\[Unless they pivot to a rollup-centric roadmap focusing on security and data availability, rather than execution - like Ethereum and Tezos have.\\]\n\n**Tl;dr: Whatever any L1 execution layer can do, a rollup can do it better.**\n\n# X, Y, Z blockchain is still faster than rollups\n\n[No.](https://www.reddit.com/r/ethfinance/comments/pk57n7/why_rollups_data_shards_are_the_only_sustainable/) Once again, whatever any L1 can do, a rollup can do it better long term. I'll point out that there's a wide-open design space with rollups, and some rollups will opt to have conservative rate limits - especially optimistic rollups. But with zkRs, they don't *have* to - they can push past the limits of L1s as described in the article linked above.\n\n# Lack of composability is bad\n\n(by u/Whovillage)\n\nThis is a common argument about rollups but it actually makes very little sense. As mentioned twice already, whatever any L1 can do, a rollup can do it better. I don't see anyone complaining about lack of composability between L1s?\n\nA rollup remains fully composable, even if it's settled across multiple data shards or external data availability sources.\n\nLike L1s are not composable with each other, so are rollups not composable with each other. But there are many interoperability solutions live like Hop, Connext, cBridge and Biconomy, and many more in the works. Indeed, there's amazing innovations [like dAMM that lets multiple zkRollups share liquidity](https://medium.com/starkware/damm-decentralized-amm-59b329fb4cc3)! In addition, eventually we can have internally sharded zk rollups which retain full synchronous composability - a feat nigh impossible on L1s. \n\n**Tl;dr: Rollup composability is superior to L1s.**\n\n# Fragmentation of liquidity is bad\n\n(by u/Beef_Lamborghinion)\n\nSee above, all of the same applies. Rollups may not share liquidity, but neither do L1s. Except, unlike L1s, they actually can with innovations like dAMM!\n\n**Tl;dr: Rollup liquidity fragmentation is less than L1 fragmentation.**\n\n# Rollups are centralized\n\n(by u/Whovillage)\n\nAll transaction data (in compressed form) and proofs are published on L1, which enable exiting a rollup directly from L1 even if the rollup itself is compromised. So, security and decentralization of rollups = security and decentralization of L1. Now, it's certainly true that rollups [may have centralized controls in the early days](https://www.reddit.com/r/ethfinance/comments/nl9cum/early_rollup_training_wheels/), but most if not all rollup projects are committed to progressive decentralization. The final form of rollups: zk rollups with decentralized sequencers, decentralized provers, decentralized L1 smart contracts and light unassisted exits - **you have security and decentralization that's practically identical to the most secure and decentralized security layer (currently Ethereum), except with the massive scalability**.\n\n# Casual users will never be able to execute the CEX - Ethereum mainnet - rollup journey / it's too expensive\n\n(by u/Whovillage, u/stevieraykatz)\n\nTop CEXs like OKEx, Huobi and Coinbase have committed to support withdrawals directly to (and deposits from) Arbitrum One and other rollups with very low fees. Bitfinex already supports withdrawals to Hermez.\n\nMeanwhile, going through Ethereum is not the only way into rollups. cBridge, for example, lets you enter Arbitrum One through Optimism, Polygon PoS, Binance Smart Chain, xDai, Avalanche or Fantom. So, there are plenty of options already, and there'll be many more over time as CEXs and fiat ramps integrate, and liquidity builds up for these various solutions. Argent is releasing with direct fiat on-ramps to zkSync and other rollups soon. With account abstraction, innovative fee models, and meta-transactions - the user experience can actually be better. We can already see this on dYdX - all gas is abstracted from the user. All the user sees is instant transactions without ever having to worry about gas - a UX better than any L1. \n\n**Tl;dr: The UX is better than any L1.** \n\n# It takes too long to withdraw from rollups\n\nThis is true for optimistic rollups - take 7 days to withdraw from rollup to L1 using the default bridge. However, as mentioned above, there are multiple options available that let you make a fast withdrawal for fungible assets. Of course, zkRollups don't have this limitation. For NFTs, zkRs are thus a preferred solution. \n\n# Rollups will be obsolete after \"Eth 2.0\"\n\nFirstly, [\"Eth2\" is deprecated nomenclature](https://notes.ethereum.org/@timbeiko/great-renaming). The two major upgrades coming to Ethereum next are The Merge which merges the consensus layer (previously eth2) with the execution layer (previously eth1) - so we're all one Ethereum again! The next major upgrade after that is data sharding on the consensus layer side. Data sharding is actually focused on accelerating rollups. So, Ethereum L1 scalability will be limited for the foreseeable future, while rollups will scale through the roof!\n\n**Tl;dr: Ethereum's roadmap is rollup-centric and designed to accelerate and empower rollups.**\n\n# Rollups are still too expensive\n\nThis is true, in the short term. Optimistic rollups like Arbitrum One and Optimistic Ethereum are reducing fees by 90%-95% currently, which while a huge improvement over Ethereum is still too expensive. With some optimizations like signature aggregation, better batching and calldata compression, this can be reduced to 99%. Indeed, zkRollups are already seeing 99% reductions getting fees down to the $0.10-$1 range even when L1 fees are high. dYdX is already doing transaction fees in the \\~$0.10 for complex DeFi derivative trades - although this is abstracted away from the end users to be gas-free. \n\nBut it doesn't stop here! When Ethereum releases data shards, rollup costs will absolutely plummet, with over a magnitude greater capacity unlocked overnight, scaling up to several orders of magnitude long term.\n\nYou can get a preview of that with validiums like Immutable X, where it costs less than a cent to mint an NFT. Indeed, it's so cheap that Immutable X is subsidizing it, so it currently costs $0.00 to mint an NFT with your Ethereum wallet! [Try it out for yourself on SwiftMint](https://swiftmint.io/). I'll note that validiums are not as secure as rollups, but they are more secure than sidechains and other L1s. Volitions further extend this by giving users the choice between rollup and validium - best of all worlds!\n\n**Tl;dr: In the long term, rollups + data shards will offer the greatest scale and lowest fees possible for given demand.**\n\n# Rollup finality is slow\n\nRollup sequencers give you \"soft confirmations\" nearly instantly - for me this is \\~0.3 seconds on average for a Uniswap trade on Arbitrum or Optimism. For most people, this soft confirmation is fine. But it's true that L1 finality is often delayed, especially in the case of zkRs. StarkNet has a great solution [with checkpoints achieving effective finality](https://ethresear.ch/t/checkpoints-for-faster-finality-in-starknet/9633) on the rollup side very quickly, at which point the finality is as fast as the L1 can finalize. As zk tech improves, Ethereum implements single-slot finality and data shards are staggered, we will see finality drop to a few seconds. You can also have a consensus mechanism on a rollup that finalizes fast - just like any L1 would - so you get the same experience, but additional security. But this gives up efficiencies gained from being a rollup. \n\nAll that said, there may be some niche usecases where settling directly on L1 still makes sense without bolstering security - but this is a very small niche.\n\n# Rollups are an Ethereum thing and bound by EVM and Solidity\n\nRollups are definitely not just an Ethereum thing. Indeed, [Tezos is embracing](https://www.youtube.com/watch?v=oqBSs0DSuzQ) a rollup-centric roadmap. Arthur Breitman, founder of Tezos, actually makes one of the best arguments for why rollups are the ultimate scalability solution, in tandem with data shards. [NEAR is also designing for sharded data availability](https://twitter.com/ilblackdragon/status/1437323779420696578). Celestia is building a security & DA layer exclusively for rollups. \n\nFurther, rollups have a wide open design space. They can experiment with VMs, fee models, coordination mechanisms, governance etc. Indeed, the room for innovation is much wider than L1s - given they always have a fallback on the most secure L1. Want a quantum-resistant VM? Use StarkNet. Like your UTXOs? Use Fuel V2. Like LLVM and Rust? Use zkSync 2.0. Just want a chain optimized for one specific application? Sure, use Immutable X for NFTs. Want a fully private chain: use Aztec. WASM? Arbitrum. Any VM, any programming language, any data model - a rollup can do it all. Indeed, it can innovate beyond any L1 with clever fee & tokenomics models (see: Immutable X's IMX token), governance structures, etc. \n\n**Tl;dr: Rollups have a wide-open design space, and anything any L1 can do, so can rollups, and then some.**\n\n# Why is Ethereum special, if you can deploy rollups elsewhere?\n\nRollups will leverage whatever is the most secure and decentralized L1 with the highest data availability that can support it.\n\nIt's clear Ethereum is orders of magnitude more secure and decentralized than any smart contract platform. Realistically, Bitcoin is the only other chain that's comparable, but of course, they lack the ability to host rollups.\n\nEthereum doesn't currently have the highest data availability, but it will, with data sharding. Meanwhile, we have validiums offering ample data availability with security that's still superior to other L1s. Data sharding inverts the trilemma - the more decentralized your network is, the more data shards you can deploy, and the more scalable your rollups will be. This is how rollups that deploy on Ethereum will scale to millions of TPS over the years, [speculatively up to 15 million TPS by 2030](https://www.reddit.com/r/ethfinance/comments/ojafms/conjecture_how_far_can_rollups_data_shards_scale/). The only area where Ethereum can be improved is the execution layer - to make it more friendly for verifying zk-SN(T)ARKs. I'm sure it will, once The Merge, data shards and statelessness are done.\n\nIt's clear, then, that Ethereum is uniquely positioned to be the best host for rollups. But this is not to say that there can't be other contenders. If Ethereum's data shards are saturated, we'll see data availability chains like Celestia or Avail potentially taking up the slack. Other L1s who are embracing a rollup-centric model, like Tezos, may also benefit if there's an overflow of demand from Ethereum-based rollups. And of course, the elephant in the room is an unexpected new competitor, though realistically, the only real competitor is if Bitcoin somehow adds the functionality to verify zk-SNARKs and implements data sharding.\n\nFor the rollups, it doesn't really matter. They'll just leverage whatever L1 offers them the best security, decentralization, network effect and data availability.\n\n**Tl;dr: Ethereum is uniquely positioned to offer the highest security, decentralization, and data availability - making it the defacto standard host for rollups.**\n\n# Rollups are stealing traffic from Ethereum\n\nEthereum execution is fully saturated, and has had full blocks for years now. All activity on rollups is net additive. Now, some may argue sharding would have expanded Ethereum's capacity - but rollups + data shards in tandem increase the overall capacity of the Ethereum ecosystem by several orders of magnitude more than the previous sharding solution.\n\n# Rollups are too complicated, no one will understand it\n\nMight I just point out I'm writing this on the day that Arbitrum One has proven to be the fastest growing smart contract platform in history? In reality, the UX for using a rollup is identical to that of using an L1, as covered before. Users need not care about the underlying architecture - to them it's just another smart contract platform. Do YouTube users care about what programming language it was written in, what OS the servers run on, what hardware the servers implement, what internet connection they use etc.? Of course not. Indeed, [I expect things will improve significantly with smart contract wallets and centralized frontends](https://polynya.medium.com/a-vision-of-ethereum-2025-bb92a0d4dc4f).\n\n# When rollups get big enough they will just abandon the base chain and create their own blockchain\n\n(by u/Whovillage)\n\nTechnically, this is possible. However, what makes a rollup special is that it's backed by the most secure and decentralized L1. This is the hardest bit, evidently so as only Bitcoin and Ethereum have managed to achieve it. Arbitrum One has already demonstrated that there's exponentially more demand for a chain backed by Ethereum's security than a more centralized consensus mechanism. On a related note, as alluded to earlier, if there's a competitor that offers better security and data availability than Ethereum, then rollups will be well incentivized to migrate. Which is fine, and will keep Ethereum core researchers and developers honest.\n\n# There are no rollup tokens, so people won't be invested in the ecosystems\n\nThis is not quite true. While there are many rollup projects in their early stage and do not yet have a token, I expect most rollups to eventually release a token. Many rollup projects do have tokens, and are using them in innovative ways - like Immutable X. Just another advantage for rollups over L1s - you can have unique and clever token and fee models.\n\n# It's too expensive to compute a zero-knowledge proof\n\nTrue, but by amortizing this over many transactions, the costs become negligible relative to gas paid for transaction calldata. Of course, we're still in the early days of zero-knowledge tech, and we'll see costs and time for computing zk proofs plummet over time. Software optimizations, GPU/FPGAs/ASICs, Moore's Law, and growing adoption with more transactions means things will only get better for zkRollups, which have already proved to be sustainable.\n\n# Can NFTs transfer easily between L1 and rollups and between rollups?\n\n(by u/Datacruncha)\n\nThis is a great question that I had overlooked. While there are multiple bridges for fungible tokens, as mentioned above, NFTs are more complicated because you can't have liquidity bridges. Currently, yes, you can transfer NFTs between L1s and rollups, but the solutions are definitely early workarounds. For example, on zkSync 1.x, you can mint an NFT there, and when you withdraw to L1, it's simply burned on zkSync 1.x and minted as an ERC-721 on L1. Cross-rollup is definitely an unresolved problem. Fortunately, this is being actively researched, and there's a lot of discussion on a [recent wrapped NFTs proposal by Vitalik](https://ethresear.ch/t/cross-rollup-nft-wrapper-and-migration-ideas/10507) to make NFTs easily transferable cross rollups. Jordi Baylina from Polygon Hermez [further expands upon it](https://ethresear.ch/t/cross-rollup-nft-wrapper-and-migration-ideas/10507/28) but really there are many insightful comments in that thread (and some low-quality trolling too!).\n\n# You're talking about the future, execution risks remain\n\nThis is absolutely true. Rollups are nascent technology, and [it'll take a couple of years to mature](https://www.reddit.com/r/ethfinance/comments/paipgj/why_the_transition_to_rollupcentric_ethereum_is_a/) and live up to their potential. Things can go wrong. Fair enough, but I do make it very clear what the current shortcomings are and how they will be fixed in the future.",
            {
                  "entities": [
                        [
                              2519,
                              2525,
                              "crypto"
                        ],
                        [
                              2530,
                              2539,
                              "crypto"
                        ],
                        [
                              6054,
                              6063,
                              "crypto"
                        ]
                  ]
            }
      ],
      [
            "**Welcome to the Weekly Discussion. Please read the disclaimer, guidelines, and rules before participating.**\n\nRules:\n\n* All [sub rules](https://www.reddit.com/r/Ethereum/about/rules/) apply in this thread.\n* Discussion topics must be related to Ethereum.\n* Behave with civility and politeness. Do not use offensive, racist or homophobic language.\n* Comments will be sorted by newest first.\n\nUseful Links:\n\n* [Ethereum.org](https://ethereum.org)\n* [ETHHub](https://ethhub.io/)\n* [ETHMerge.com](https://ethmerge.com/)\n\n**Reminder**\n\n/r/ethereum is a community for discussing the technology, news, applications and community of Ethereum. **Discussion of the Ether price or trading is not allowed.** Please keep those discussions to [/r/ethfinance](https://www.reddit.com/r/ethfinance) and [/r/ethstaker](https://www.reddit.com/r/ethstaker).\n\n&#x200B;\n\n**Frequently Asked Questions**\n\n**Where's the best place to buy ETH?**\n\nThere are many centralized exchanges that support Ethereum. If you live in the US, the most popular exchanges are Coinbase, Gemeni and Kraken. Coinbase users can use Coinbase Pro for lower fees.\n\n**When is Eth2 launching?**\n\nEth2 is a marketing term used to represent a number of updates to Ethereum. The Eth2 proof-of-stake chain first launched in December 2020. \"The Merge\", which is the event that will fully switch Ethereum's consensus to proof-of-stake, is estimated to be ready in early 2022, although there is no exact timeline. Other updates, such as data shards, will follow that update.\n\nVisit [ethmerge.com](https://ethmerge.com/) to learn more about \"The Merge\".\n\n**Do I need to do anything to update to Eth2? Will Eth2 create a new token?**\n\nNo, ETH holders *never* need to take any action to keep holding ETH. Ethereum users will be unaffected by the Eth2 upgrade. And the Eth2 updates will not create any new tokens.\n\n**How can I stake my ETH?**\n\nThere are two ways that you can stake your ETH: by running your own validator, or providing your ETH to a staking pool.\n\n* Running your own validator requires a modern computer and 32 ETH. Visit /r/ethstaker for more details\n* Staking pools accept any amount of ETH. We recommend [Lido](https://lido.fi/) or [StakeWise](https://stakewise.io/)\n\n**Why are Ethereum transaction fees so high?**\n\nLike most blockchains, Ethereum fees are determined by supply-and-demand. The large demand to use Ethereum has pushed transaction fees quite high (however, fees were just a few cents only 2 years ago). Fees are especially high during market volatility, and during NFT drops.\n\n**What is being done to lower Ethereum transaction fees?**\n\nEthereum fees are reduced by using layer-2 rollups. Rollups are scaling solutions that allow for significantly cheaper transactions, while still maintaining Ethereum's security.\n\nAdditionally, Eth2's data shards will make rollups even cheaper.\n\nWhile rollups are cutting-edge technology being actively developed, a number are already live on Ethereum mainnet. Visit [l2beat.com](https://l2beat.com/) to learn more about rollups.\n\n**What's the best wallet for Ethereum?**\n\nThe most popular tool for using decentralized applications is Metamask. However, for security reasons, we recommend using a hardware wallet such as a Trezor or Ledger.\n\n&#x200B;\n\nAre there questions you'd like to see added? Leave a comment below.",
            {
                  "entities": [
                        [
                              449,
                              452,
                              "crypto"
                        ],
                        [
                              480,
                              483,
                              "crypto"
                        ],
                        [
                              914,
                              917,
                              "crypto"
                        ],
                        [
                              1681,
                              1684,
                              "crypto"
                        ],
                        [
                              1741,
                              1744,
                              "crypto"
                        ],
                        [
                              1876,
                              1879,
                              "crypto"
                        ],
                        [
                              1927,
                              1930,
                              "crypto"
                        ],
                        [
                              1981,
                              1984,
                              "crypto"
                        ],
                        [
                              2068,
                              2071,
                              "crypto"
                        ],
                        [
                              2146,
                              2149,
                              "crypto"
                        ]
                  ]
            }
      ],
      [
            "I bought 5 ETH in january, it was my first real investment in crypto and investing in general.\nI looked at the charts every minute of everyday for 2 weeks straight. I was going crazy of fear, fear that I would loose all my hard earned money… So I sold with a loss..\nLooking back at it now, I regret it so badly..\nLesson learned : DYOR, Buy & HODL!",
            {
                  "entities": [
                        [
                              11,
                              14,
                              "crypto"
                        ]
                  ]
            }
      ],
      [
            "Please make sure you read the entire post[.](https://a.thumbs.redditmedia.com/vb0vfwrVCdHds6ESQaGK38rHgmLtm2Z9QwoDxL9DqP4.png)\n\n\nSeveral months ago I asked the community here to make some posts about how to buy dogecoin. Many of you helped. Thank you! This post hasn't been updated for a while and after reading through 1000s of comments within the previous three versions of this post it seems like the two best exchanges at the moment are Binance and Coinbase. \n\nTo save you the time here is a links.  \n\nClick -->> [Binance with the maximum 20% discount trading fees permanently applied](https://accounts.binance.com/en/register?ref=I6RQALXK). \n\nClick -->> [Coinbase for those from the US or who want another place to buy other than Binance.](https://www.coinbase.com/join/man_pj0)\n\nAfter going through the simple verification process you will now be able to buy Dogecoin and the majority of other good currencies available where you can trade, stake, sell, hold, or earn interest. Be sure to follow the guides on these sites (some even pay you coins to do this) to make sure you're up to date with all the latest ways to keep your coins safe and use crypto safely.  \n\n\nThere were many posts made by the community and they all have good information in them. Some of these posts have been kept up to date and they are below. \n\n___\n\n* [The Ultimate Simple Guide for Buying, Trading and Storing Dogecoin ](https://www.reddit.com/r/dogecoin/comments/mso3z0/the_ultimate_simple_guide_for_buying_trading_and/)\n\n___\n\n\n* [How to buy Dogecoin in 5 easy steps in 5 easy hours](https://www.reddit.com/r/dogecoin/comments/l7np1m/how_to_buy_dogecoin_in_5_easy_steps_in_5_easy/)\n\n___\n\n* [How to Buy/Own Dogecoin: Lowest fees](https://www.reddit.com/r/dogecoin/comments/n0y13z/beginners_guide_how_to_buyown_dogecoin_with_the/)\n\n___\n\n* [How to buy Doge for in 5 eezy steps (FOR DUMDUMS)](https://www.reddit.com/r/dogecoin/comments/l7nxxp/how_to_buy_doge_for_in_5_eezy_steps_for_dumdums/) \n\n___\n\n* [How to Purchase Dogecoin in 2021](https://www.reddit.com/r/dogecoin/comments/l7ok46/how_to_purchase_dogecoin_in_2021/) \n\n \n\n___\n\n* [HOW TO BUY DOGE COIN SO SIMPLE SUCH WOW](https://www.reddit.com/r/dogecoin/comments/l7nzb5/how_to_buy_doge_coin_so_simple_such_wow/)\n\n___\n\n* [How to buy Cryptocurrency in an easy way and get some free money by my referral.](https://www.reddit.com/r/dogecoin/comments/l7po3q/for_beginner_how_to_buy_cryptocurrency_in_an_easy/)  \n\n___\n\n\n* [DOGECOIN - How to buy DOGE COIN with cheapest trading fee](https://www.reddit.com/r/dogecoin/comments/l88yrw/dogecoin_how_to_buy_doge_coin_with_cheapest/)\n\n___\n\n* [How to buy Dogecoin TODAY](https://www.reddit.com/r/dogecoin/comments/l82jfq/how_to_buy_dogecoin_today/)\n\n___\n\n* [How To Buy DOGECOIN (Simple & Easy) UK,AUST,EUROPE,ASIA](https://www.reddit.com/r/dogecoin/comments/lag3ig/how_to_buy_dogecoin_simple_easy_ukausteuropeasia/)\n\n___\n\nTo the moon!\n\nBonus message - I've allowed referral links to be used in these posts and links even though they are not allowed to be used generally in the subreddit. NEVER listen to financial advice from anyone other than a professional financial advisor! That includes on reddits posts and comments. \n\n---\n\nEdit: The posts above can be edited any time by the people who wrote them. If you feel there is a serious error or mistake please send modmail and I will remove the post and ask the OP to sort it out.\n\n---\n\nEdit Edit.. This post was refreshed in April 2021, June and November. Once a post gets a few months old and reddit stops comments. We can't have that! I have rearranged the posts above in order of the last time they were updated so the most updated posts are at the top.\n\nWARNING. Do NOT fall for hype. Don't think you're going to get instantly rich. Don't trust random people offering financial advice. Cryptocurrency is the wild wild west of investing and many people want to take your money and run. You must 'educated' yourself with the good and the bad. You must understand what you're doing.",
            {
                  "entities": [
                        [
                              211,
                              219,
                              "crypto"
                        ],
                        [
                              1430,
                              1438,
                              "crypto"
                        ],
                        [
                              1594,
                              1602,
                              "crypto"
                        ],
                        [
                              1630,
                              1638,
                              "crypto"
                        ],
                        [
                              1739,
                              1747,
                              "crypto"
                        ],
                        [
                              1794,
                              1802,
                              "crypto"
                        ],
                        [
                              1899,
                              1907,
                              "crypto"
                        ],
                        [
                              2043,
                              2051,
                              "crypto"
                        ],
                        [
                              2084,
                              2092,
                              "crypto"
                        ],
                        [
                              2182,
                              2190,
                              "crypto"
                        ],
                        [
                              2365,
                              2373,
                              "crypto"
                        ],
                        [
                              2538,
                              2546,
                              "crypto"
                        ],
                        [
                              2563,
                              2571,
                              "crypto"
                        ],
                        [
                              2670,
                              2678,
                              "crypto"
                        ],
                        [
                              2706,
                              2714,
                              "crypto"
                        ],
                        [
                              2814,
                              2822,
                              "crypto"
                        ],
                        [
                              2850,
                              2858,
                              "crypto"
                        ]
                  ]
            }
      ],
      [
            "Hi Shibes,\n\nWelcome to todays Daily Discussion post. You are dogecoin!\n\n#TeamSeas teams up with Mr Beast, Mark Rober and Dogecoin to help save the Oceans, Beaches and Rivers!\n\n“This year Dogecoin is teaming up with Mr Beast, Mark Rober and good shibes all around the world to remove 30 MILLION pounds of trash from our oceans. Read on to find out how you how you can help us save the planet, the Doge way.”\n\nDonations taken in Dogecoin!\n\nhttps://dogecoin.com/teamseas/\n\nĐ145234 Dogecoin donated so far! That’s incredible shibes! I can’t wait to see what this looks like by the deadline of January 1st 😎\n\nYou can also get the latest version of the dogecoin wallet (version  1.14.5) from www.dogecoin.com \n\n---\n\nHere are some links and topics that people have wanted me to post here recently. Please take a look!\n\n* [HOW TO BUY DOGECOIN GUIDE UPDATED](https://redd.it/qrhcs5/) - https://redd.it/qrhcs5\n\n* [Such News! Are we ready for our tipbot keys?](https://www.reddit.com/r/dogecoin/comments/nw6okq/such_news_are_we_ready_for_our_tipbot_keys_ive/)\n\n* [Cryptwerk.com is a list of many many many places you can spend dogecoin.](https://cryptwerk.com/pay-with/doge/)\n\n* [Ledger - hardware wallet to keep your coins safe!]( https://shop.ledger.com/pages/ledger-nano-x?r=37eb5debb6b8) \n\n* [Advice from a Gambling Counsellor](https://www.reddit.com/r/dogecoin/comments/mwrltk/advice_from_a_gambling_counsellor/) - https://redd.it/mwrltk\n\n* [Looking after your mental health](https://reddit.com/r/dogecoin/comments/mtf2ym/reminder_that_dogecoin_is_awesome_but_its_not/) - https://redd.it/mtf2ym\n\n* [Being aware of scammers](https://www.reddit.com/r/dogeducation/comments/n9nwfc/scammers/)\n\n* [Another Shibe wrote a post about being aware of scams.](https://redd.it/mrq5c9) - https://redd.it/mrq5c9\n\n* [F@H (Folding@Home) and GitHub are NOT Doge helplines!](https://www.reddit.com/r/dogecoin/comments/n6wtnr/fh_foldinghome_and_github_are_not_doge_helplines/)\n\n* [From 7 years ago. An open letter to the Dogecoin community from co-founder Billy Markus](https://www.reddit.com/r/dogecoin/comments/1xaeue/enjoy_this_moment_an_open_letter_to_the_dogecoin/)\n\n* [Had a few people ask me to mention this petition to get Amazon to accept dogecoin](http://chng.it/R48d6XYwMr)\n\n---\n\n\n\nFor more technical discussions about dogecoin please visit /r/dogecoindev \n\n---\n\n\nDon't forget to report posts and comments you think are not appropriate for the subreddit. If you want to discuss something specific please [message the moderators](https://www.reddit.com/message/compose/?to=/r/dogecoin)\n\nDo you want something added here? Send the moderators modmail to discuss.\n\nHave fun!\n\n42\n\n___\n\n**D**o **O**nly **G**ood **E**veryday\n\nYesterday's daily discussion post: \nhttps://www.reddit.com/r/dogecoin/comments/r0ayhv/dogecoin_daily_discussion_23rd_november/",
            {
                  "entities": [
                        [
                              61,
                              69,
                              "crypto"
                        ],
                        [
                              446,
                              454,
                              "crypto"
                        ],
                        [
                              647,
                              655,
                              "crypto"
                        ],
                        [
                              690,
                              698,
                              "crypto"
                        ],
                        [
                              975,
                              983,
                              "crypto"
                        ],
                        [
                              1116,
                              1124,
                              "crypto"
                        ],
                        [
                              1346,
                              1354,
                              "crypto"
                        ],
                        [
                              1491,
                              1499,
                              "crypto"
                        ],
                        [
                              1530,
                              1538,
                              "crypto"
                        ],
                        [
                              1876,
                              1884,
                              "crypto"
                        ],
                        [
                              2070,
                              2078,
                              "crypto"
                        ],
                        [
                              2135,
                              2143,
                              "crypto"
                        ],
                        [
                              2223,
                              2231,
                              "crypto"
                        ],
                        [
                              2305,
                              2313,
                              "crypto"
                        ],
                        [
                              2330,
                              2338,
                              "crypto"
                        ],
                        [
                              2561,
                              2569,
                              "crypto"
                        ],
                        [
                              2767,
                              2775,
                              "crypto"
                        ],
                        [
                              2792,
                              2800,
                              "crypto"
                        ]
                  ]
            }
      ]
]